; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v11)
             (pred_12 ?v12 ?v9)
             (pred_2 ?v5 ?v9)
             (pred_5 ?v8 ?v5 )
	     (pred_1 ?v5)
             (pred_10 ?v3)
             (pred_9 ?v12)
             (pred_3 ?v9)
             (pred_4 ?v5)
             (pred_11 ?v12)
             (pred_7 ?v5)
             (pred_8 ))



(:action op_4
:parameters (?v6 ?v2 ?v1 ?v4)
:precondition (and (pred_10 ?v6) (pred_10 ?v2) (pred_9 ?v1) (pred_3 ?v4)
          (pred_6 ?v6 ?v2) (pred_12 ?v1 ?v4)
                   (pred_2 ?v2 ?v4) (pred_1 ?v6) 
                   (pred_4 ?v2) (pred_11 ?v1))
:effect (and  (pred_7 ?v2) (not (pred_4 ?v2))))


(:action op_5
:parameters (?v6 ?v13)
:precondition (and (pred_10 ?v6) (pred_10 ?v13)
               (pred_1 ?v6) (pred_6 ?v6 ?v13) (pred_7 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v6))))

(:action op_3
:parameters (?v6 ?v1)
:precondition (and (pred_10 ?v6) (pred_9 ?v1) 
                  (pred_1 ?v6) (pred_5 ?v1 ?v6) (pred_8 ))
:effect (and (pred_11 ?v1)
   (not (pred_5 ?v1 ?v6)) (not (pred_8 ))))


(:action op_2
:parameters (?v6 ?v7 ?v10)
:precondition (and (pred_10 ?v6) (pred_9 ?v7) (pred_9 ?v10)
                  (pred_1 ?v6) (pred_11 ?v10) (pred_5 ?v7 ?v6))
:effect (and (pred_11 ?v7) (pred_5 ?v10 ?v6)
        (not (pred_11 ?v10)) (not (pred_5 ?v7 ?v6))))

(:action op_1
:parameters (?v6 ?v1)
:precondition (and (pred_10 ?v6) (pred_9 ?v1) 
                  (pred_1 ?v6) (pred_11 ?v1))
:effect (and (pred_8 ) (pred_5 ?v1 ?v6) (not (pred_11 ?v1)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_08 obj_31 obj_11 obj_20 obj_17 obj_14 obj_04 obj_22 obj_25 obj_13 obj_18 obj_24 obj_26 obj_05 obj_12 obj_21 obj_23 obj_27 obj_10 obj_06 obj_02 obj_29 obj_19 obj_07
    obj_01 obj_16 obj_28
    obj_03 obj_09 obj_15
    )

    (:init
       (pred_8)

       (pred_10 obj_30)
       (pred_10 obj_08)
       (pred_10 obj_31)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_04)
       (pred_10 obj_22)
       (pred_10 obj_25)
       (pred_10 obj_13)
       (pred_10 obj_18)
       (pred_10 obj_24)
       (pred_10 obj_26)
       (pred_10 obj_05)
       (pred_10 obj_12)
       (pred_10 obj_21)
       (pred_10 obj_23)
       (pred_10 obj_27)
       (pred_10 obj_10)
       (pred_10 obj_06)
       (pred_10 obj_02)
       (pred_10 obj_29)
       (pred_10 obj_19)
       (pred_10 obj_07)
       (pred_3 obj_01)
       (pred_3 obj_16)
       (pred_3 obj_28)
       (pred_9 obj_03)
       (pred_9 obj_09)
       (pred_9 obj_15)

       (pred_6 obj_30 obj_17)
       (pred_6 obj_30 obj_08)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_31)
       (pred_6 obj_08 obj_30)
       (pred_6 obj_31 obj_04)
       (pred_6 obj_31 obj_11)
       (pred_6 obj_31 obj_08)
       (pred_6 obj_11 obj_22)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_31)
       (pred_6 obj_20 obj_25)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_17 obj_13)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_30)
       (pred_6 obj_14 obj_18)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_04 obj_24)
       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_31)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_22 obj_26)
       (pred_6 obj_22 obj_25)
       (pred_6 obj_22 obj_11)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_25 obj_05)
       (pred_6 obj_25 obj_20)
       (pred_6 obj_25 obj_22)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_18 obj_24)
       (pred_6 obj_18 obj_14)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_24 obj_23)
       (pred_6 obj_24 obj_26)
       (pred_6 obj_24 obj_04)
       (pred_6 obj_24 obj_18)
       (pred_6 obj_26 obj_27)
       (pred_6 obj_26 obj_05)
       (pred_6 obj_26 obj_22)
       (pred_6 obj_26 obj_24)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_25)
       (pred_6 obj_05 obj_26)
       (pred_6 obj_12 obj_06)
       (pred_6 obj_12 obj_21)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_21 obj_23)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_21 obj_12)
       (pred_6 obj_23 obj_29)
       (pred_6 obj_23 obj_27)
       (pred_6 obj_23 obj_24)
       (pred_6 obj_23 obj_21)
       (pred_6 obj_27 obj_19)
       (pred_6 obj_27 obj_10)
       (pred_6 obj_27 obj_26)
       (pred_6 obj_27 obj_23)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_27)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_12)
       (pred_6 obj_02 obj_29)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_29 obj_19)
       (pred_6 obj_29 obj_23)
       (pred_6 obj_29 obj_02)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_19 obj_27)
       (pred_6 obj_19 obj_29)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_19)
       (pred_4 obj_05)
       (pred_4 obj_29)
       (pred_4 obj_31)
       (pred_2  obj_05 obj_01)
       (pred_2  obj_29 obj_16)
       (pred_2  obj_31 obj_28)
       (pred_7 obj_30)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_14)
       (pred_7 obj_04)
       (pred_7 obj_22)
       (pred_7 obj_25)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_24)
       (pred_7 obj_26)
       (pred_7 obj_12)
       (pred_7 obj_21)
       (pred_7 obj_23)
       (pred_7 obj_27)
       (pred_7 obj_10)
       (pred_7 obj_06)
       (pred_7 obj_02)
       (pred_7 obj_19)
       (pred_7 obj_07)

       (pred_12  obj_03 obj_01)
       (pred_12  obj_09 obj_16)
       (pred_12  obj_15 obj_28)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_09 obj_02)
       (pred_5 obj_15 obj_23)
       (pred_1 obj_18)
    )

    (:goal (and
       (pred_5 obj_09 obj_07)
    ))
(:constraints
  (always (not (pred_1 obj_29)))
)
)

; plan
1. (op_5 obj_18 obj_21)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_21)
   goals met: 0 of 1
2. (op_5 obj_21 obj_02)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_02)
   goals met: 0 of 1
3. (op_3 obj_02 obj_09)
   deleted: (pred_5 obj_09 obj_02) (pred_8)
   added: (pred_11 obj_09)
   goals met: 0 of 1
4. (op_5 obj_02 obj_21)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_21)
   goals met: 0 of 1
5. (op_5 obj_21 obj_23)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_23)
   goals met: 0 of 1
6. (op_5 obj_23 obj_27)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_27)
   goals met: 0 of 1
7. (op_5 obj_27 obj_10)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_10)
   goals met: 0 of 1
8. (op_5 obj_10 obj_07)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_07)
   goals met: 0 of 1
9. (op_2 obj_07 obj_03 obj_09)
   deleted: (pred_11 obj_09) (pred_5 obj_03 obj_07)
   added: (pred_11 obj_03) (pred_5 obj_09 obj_07)
   goals met: 1 of 1
